Revit 2027 API
ElementFilter.PassesFilter(Element) Method
 Applies the filter to a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PassesFilter(
	Element element
)
Public Function PassesFilter (
	element As Element
) As Boolean
public:
bool PassesFilter(
	Element^ element
)
member PassesFilter :
        element : Element -> bool
Parameters
element Element
 The element.
Return Value
Boolean
 True if the element is accepted by the filter. False if the element is rejected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementFilter Class
PassesFilter Overload
Autodesk.Revit.DB Namespace